# DetailLevel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..DetailLevel Property
View Class See Also
---
The detail level of this view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ViewDetailLevel DetailLevel { get; set; }
```

Visual Basic
---
```text
Public Property DetailLevel As ViewDetailLevel
	Get
	Set
```

Visual C++
---
```text
public:
property ViewDetailLevel DetailLevel {
	ViewDetailLevel get ();
	void set (ViewDetailLevel value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: Cannot set ViewDetailLevel to Unassigned |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: View does not have a Detail Level property -or- When setting this property: Detail Level cannot be modified. |

# See Also
View Class
Autodesk.Revit.DB Namespace